import java.util.Scanner;
public class classwork0208 {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        /*
--------Lesson 5-Classwork-----------------------------------------------------------------------------------
         */
        //Case1. Дано целое число в диапазоне 1–7. Вывести строку — название дня
        //недели, соответствующее данному числу (1 — «понедельник», 2 — «вторник» и т. д.).
        /*
        System.out.print("Введите число (1-7): ");
        int  = in.nextInt();
        if (==1) System.out.println("Понедельник");
        else if (==2) System.out.println("Вторник");
        else if (==3) System.out.println("Среда");
        else if (==4) System.out.println("Четверг");
        else if (==5) System.out.println("Пятница");
        else if (==6) System.out.println("Суббота");
        else if (==7) System.out.println("Воскресенье");
        else System.out.println("Введено неверное число");
         */
        /*
        System.out.print("Введите число (1-7): ");
        int  = in.nextInt();
        switch (){
            case 1:
                System.out.println("Понедельник");
                break;
            case 2:
                System.out.println("Вторник");
                break;
            case 3:
                System.out.println("Среда");
                break;
            case 4:
                System.out.println("Четверг");
                break;
            case 5:
                System.out.println("Пятница");
                break;
            case 6:
                System.out.println("Суббота");
                break;
            case 7:
                System.out.println("Воскресенье");
                break;
            default:
                System.out.println("Введено неверное значение");
         */
        /*
------------------------------------------------------------------------------------------------
         */
        //Case2. Дано целое число K.
        //Вывести строку-описание оценки, соответствующей числу K (1 — «плохо», 2 — «неудовлетворительно»,
        //3 — «удовлетворительно», 4 — «хорошо», 5 — «отлично»). Если K не лежит в диапазоне 1–5,
        //то вывести строку «ошибка».
        /*
------------------------------------------------------------------------------------------------
         */
        //For1. Даны целые числа K и N (N > 0). Вывести N раз число K.
        /*
        System.out.println("Введите два числа К и N: ");
        System.out.print("К = ");
        int k = in.nextInt();
        System.out.print("N = ");
        int n = in.nextInt();
        for (int i = 0;i<n;i++){
            System.out.println(k);
        }
        */
        /*
-------------------------------------------------------------------------------------------------
         */
        //For2. Даны два целых числа A и B (A < B). Вывести в порядке возрастания все целые числа,
        //расположенные между A и B (включая сами числа A и B), а также количество N этих чисел.
        /*
        System.out.println("Введите два числа A и B: ");
        System.out.print("A = ");
        int a = in.nextInt();
        System.out.print("B = ");
        int b = in.nextInt();
        int result = 0;
        for (int i=a;i<=b;a++){
            result +=1;
            System.out.println(i);
        }
        System.out.println(result);
        */
        /*
------------------------------------------------------------------------------------------------
         */
        //For3. Даны два целых числа A и B (A < B).
        //Вывести в порядке убывания все целые числа,
        //расположенные между A и B (не включая числа A и B), а также количество N этих чисел.
        /*
        System.out.println("Введите два числа A и B: ");
        System.out.print("A = ");
        int a = in.nextInt();
        System.out.print("B = ");
        int b = in.nextInt();
        int result = 0;
        for (int i = b-1;i>a;i--){
            System.out.println(b);
            result+=1;
        }
        System.out.println("\n"+result);
         */
        /*
------------------------------------------------------------------------------------------------
         */
        //For4. Дано вещественное число — цена 1 кг конфет. Вывести стоимость 1, 2, ..., 10 кг конфет.
        /*
        System.out.println("Введите стоймость 1кг конфет: ");
        int price = in.nextInt();
        for (int i=1;i<=10;i++){
            System.out.println("1 кг конфет будет стоить "+(price*i)+" USD");
        }
         */
        /*
-------------------------------------------------------------------------------------------------
         */
        //For6. Дано вещественное число — цена 1 кг конфет.
        //Вывести стоимость 1.2, 1.4, . .., 2 кг конфет.
        /*
        System.out.println("Введите стомость 1 кг конфет: ");
        double price = in.nextDouble();
        for (double weigh = 1.1;weigh<=2.01;weigh+=0.1){
            System.out.println((Math.round(weigh*10)/10.0)+" кг конфет стоит "+(Math.round(price*weigh*100)/100.0)+" ");
        }
        */
        /*
---------------------------------------------------------------------------------------------------
         */
        //For7. Даны два целых числа A и B (A < B). Найти сумму всех целых чисел от A до B включительно.
        /*
        System.out.println("Введите два числа (А<В): ");
        System.out.print("A = ");
        int a = in.nextInt();
        System.out.print("B = ");
        int b = in.nextInt();
        int sum = 0;
        for (;a<=b;a++){
            sum += a;
        }
        System.out.println(sum);
         */
        /*
---------------------------------------------------------------------------------------------------
         */
        //For8. Даны два целых числа A и B (A < B).
        //Найти произведение всех целых чисел от A до B включительно.
        /*
        System.out.println("Введите два числа (А<В): ");
        System.out.print("A = ");
        int a = in.nextInt();
        System.out.print("B = ");
        int b = in.nextInt();
        int multiplication = 1;
        for (;a<=b;a++){
            multiplication *=a;
        }
        System.out.println(multiplication);
        */
        /*
----------------------------------------------------------------------------------------------------
         */
        //For9. Даны два целых числа A и B (A < B).
        //Найти сумму квадратов всех целых чисел от A до B включительно.
        /*
        System.out.println("Введите два числа (А<В): ");
        System.out.print("A = ");
        int a = in.nextInt();
        System.out.print("B = ");
        int b = in.nextInt();
        int sum = 0;
        for (;a<=b;a++){
            sum += (a * a);
        }
        System.out.println(sum);
         */
        /*
----------------------------------------------------------------------------------------------------
         */
        //For10. Дано целое число N (>0).
        //Найти сумму 1 + 1/2 + 1/3 + ... + 1/N (вещественное число).
        /*
        System.out.println("Введите целое число: ");
        int n = in.nextInt();
        double sum = 0;
        for (int i = 1;i<=n;i++){
            sum+=(1/(double)i);
        }
        System.out.println(sum);
         */
        /*
---------------------------------------------------------------------------------------------------
         */
        //For11. Дано целое число N (>0).
        //Найти сумму N^2 + (N+1)^2 + (N+2)^2 + ... + (2·N)^2 (целое число).
        /*
        System.out.println("Введите целое число: ");
        int n = in.nextInt();
        int sum = n*n;
        for (int i = 1;i<=n;i++){
            sum += Math.round(Math.pow(n+i,2)); //sum += (n+i, 2)*(n+i, 2);
        }
        System.out.println(sum);
         */
        /*
---------------------------------------------------------------------------------------------------
         */
        //Series1◦. Даны десять вещественных чисел. Найти их сумму.
        /*
        int sum = 0;
        for (int i = 1;i<=10;i++){
            System.out.print("Введите число: ");
            sum += in.nextInt();
        }
        System.out.println(sum);
        */
        /*
---------------------------------------------------------------------------------------------------
         */
        //Series2. Даны десять вещественных чисел. Найти их произведение.
        /*
        int mult = 1;
        for (int i = 1;i<=10;i++){
            System.out.print("Введите число: ");
            mult *= in.nextInt();
        }
        System.out.println(mult);
         */
        /*
-----------------------------------------------------------------------------------------------------
         */
        //Series3. Даны десять вещественных чисел. Найти их среднее арифметическое.
        /*
        int res = 0;
        for (int i = 1;i<=5;i++){
            System.out.print("Ввести число: ");
            res += in.nextInt();
        }
        System.out.println(res/5.0);
         */
        /*
----------------------------------------------------------------------------------------------------
         */
        //Series4. Дано целое число N и набор из N вещественных чисел.
        //Вывести сумму и произведение чисел из данного набора.
        /*
        System.out.print("Введите число N: ");
        int n = in.nextInt();
        double sum = 0;
        double mult = 1;
        for (int i = 1;i<=n;i++){
            System.out.print("Введите вещественное число: ");
            double num = in.nextDouble();
            sum += num;
            mult *= num;
        }
        System.out.println("Сумма: "+sum);
        System.out.println("Произведение: "+mult);
         */
        /*
---------------------------------------------------------------------------------------------------
         */
        //Series5. Дано целое число N и набор из N положительных вещественных чисел.
        //Вывести в том же порядке целые части всех чисел из данного набора
        //(как вещественные числа с нулевой дробной частью), а также сумму всех целых частей.
        /*
        System.out.print("Введите число N: ");
        int n = in.nextInt();
        int sum = 0;
        for (int i = 1;i<=n;i++){
            System.out.print("Введите положительное вещественое число: ");
            double num = in.nextDouble();
            double num1 = (int)num;
            sum +=(num);
            System.out.println(num1);
        }
        System.out.println("Сумма: "+sum);
         */
        /*
--------------------------------------------------------------------------------------------------
         */
        //Series6. Дано целое число N и набор из N положительных вещественных чисел.
        //Вывести в том же порядке дробные части всех чисел из данного набора
        //(как вещественные числа с нулевой целой частью), а также произведение всех дробных частей.
        /*
        System.out.print("Введите число N: ");
        int n = in.nextInt();
        double mult = 1;
        for (int i = 1;i<=n;i++){
            System.out.print("Введите положительное вещественое число: ");
            double num = in.nextDouble();
            double num1 = (int)num;
            double num2 = num-num1;
            mult *=num2;
            System.out.println(num2);
        }
        System.out.println(mult);
        */
        /*
--------------------------------------------------------------------------------------------------
         */
        //Series7. Дано целое число N и набор из N вещественных чисел.
        //Вывести в том же порядке округленные значения всех чисел из данного набора
        //(как целые числа), а также сумму всех округленных значений.
        /*
        System.out.print("Введите число N: ");
        int n = in.nextInt();
        int sum = 0;
        for (int i = 1;i<n;i++){
            System.out.print("Введите положительное вещественое число: ");
            double num = in.nextDouble();
            sum += Math.round(num);
            System.out.println(Math.round(num));
        }
         */
        /*
--------------------------------------------------------------------------------------------------
         */
        //Series8. Дано целое число N и набор из N целых чисел.
        //Вывести в том же порядке все четные числа из данного набора и количество K таких чисел.
        /*
        System.out.print("Введите число N: ");
        int n = in.nextInt();
        int k = 0;
        for (int i = 1;i<n;i++){
            System.out.println("Введите целое число: ");
            int num = in.nextInt();
            if (num%2!=1){
                System.out.println("Число "+num+" четное");
                k +=1;
            }
        }
         */
        /*
----------------------------------------------------------------------------------------------------
         */
        //Series9. Дано целое число N и набор из N целых чисел.
        //Вывести в том же порядке номера всех нечетных чисел из данного набора и количество K таких чисел.
        /*
        System.out.print("Введите число N: ");
        int n = in.nextInt();
        int k = 0;
        for (int i = 1;i<n;i++){
            System.out.println("Введите целое число: ");
            int num = in.nextInt();
            if (num%2==1){
                System.out.println("Число "+num+" четное");
                k +=1;
            }
        }
         */
        /*
----------------------------------------------------------------------------------------------------
         */
        //Series10. Дано целое число N и набор из N целых чисел.
        //Если в наборе имеются положительные числа, то вывести TRUE; в противном случае вывести FALSE.
        System.out.print("Введите число N: ");
        int n = in.nextInt();

    }
}
